app/controllers/users/contatos_controller.rb

  def index
    @contatos = Contato.all
---
SELECT * FROM "contatos"

  def index_ajax
    @contatos = Contato.all
---
SELECT * FROM "contatos"

  def create
    @contato = Contato.new(params[:contato])
    @contato.user = current_user

    unless @contato.save
---
INSERT INTO "contatos" ("created_at", "nome", "updated_at", "user_id", "email") VALUES('2010-08-23 20:10:21.736011', 'Túlio Ornelas dos Santos', '2010-08-23 20:10:21.736011', 1, 'ornelas.tulio@gmail.com') RETURNING "id"

  def destroy
    @contato = Contato.find params[:id]
    @contato.destroy
---
SELECT * FROM "contatos" WHERE ("contatos"."id" = 1)
DELETE FROM "contatos" WHERE "id" = 1