app/controllers/users/grupos_controller.rb

  def index
    @grupos = Grupo.all
---
SELECT * FROM "grupos"